# RegenerationAttribute Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RegenerationAttribute Constructor
RegenerationAttribute Class See Also
---
Constructs a new RegenerationAttribute.
**Namespace:** Autodesk.Revit.Attributes**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public RegenerationAttribute(
	RegenerationOption option
)
```

Visual Basic
---
```text
Public Sub New ( _
	option As RegenerationOption _
)
```

Visual C++
---
```text
public:
RegenerationAttribute(
	RegenerationOption option
)
```

# ### Parameters
option
    Type: Autodesk.Revit.Attributes..::..RegenerationOption
# See Also
RegenerationAttribute Class
Autodesk.Revit.Attributes Namespace